EDT_TS/src/Documents/ReceiptOfGoodsAndServises/ReceiptOfGoodsAndServises.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReceiptOfGoodsAndServises</name>
</mdclass:Document>

EDT_TS/src/AccumulationRegisters/TotalSeal/TotalSeal.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>TotalSeal</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Summ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Contractor</name>
    <type>
      <types>CatalogRef.ContractingParties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Deal</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Storage</name>
    <type>
      <types>CatalogRef.Storage</types>
    </type>
  </dimensions>
  <dimensions>
    <name>GaS</name>
    <type>
      <types>CatalogRef.Nomenklatura</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT_TS/src/Documents/ReceiptOfGoodsAndServises/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр TotalSeal 
	Движения.TotalSeal.Записывать = Истина;
	Для Каждого ТекСтрокаGoodsAndServices Из GoodsAndServices Цикл
		Движение = Движения.TotalSeal.Добавить();
		Движение.Период = Дата;
		Движение.Contractor = Contractor;
		Движение.Deal = Deal;
		Движение.Storage = Storage;
		Движение.GaS = ТекСтрокаGoodsAndServices.GaS;
		Движение.Summ = ТекСтрокаGoodsAndServices.Summ;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
